In [50]:
import pandas as pd

In [51]:
pro = pd.read_csv('교수.csv', index_col='교수번호')
pro2 = pro.copy()
pro2.reset_index(inplace=True)
pro2=pro2[['교수번호', '교수이름', '교수학과']]
pro2

   교수번호 교수이름 교수학과
0   221  이병렬   전산
1   228  이재광   전산
2   311  강승일   전자
3   509  오문환   건축

In [52]:
stu = pd.read_csv('학생.csv', index_col='학생번호')
filt = stu['지도교수'] == 221
stu[filt]

         학생이름 학생학과  학년      생년월일  지도교수
학생번호
92414033  김창덕   전산   4  73/10/26   221
95414058  박혜경   전산   4  76/03/12   221

In [53]:
pro_stu = stu.merge(pro2, how='inner', left_on='지도교수', right_on='교수번호')
pro_stu.drop(columns='교수번호', inplace=True)
pro_stu.groupby('지도교수').get_group(228)

  학생이름 학생학과  학년      생년월일  지도교수 교수이름 교수학과
0  서연우   전산   3  73/10/06   228  이재광   전산
7  김수정   전산   3  77/12/22   228  이재광   전산

In [54]:
for code in pro.index:
    df=pro_stu.groupby('지도교수').get_group(code)
    print(df)

  학생이름 학생학과  학년      생년월일  지도교수 교수이름 교수학과
1  김창덕   전산   4  73/10/26   221  이병렬   전산
6  박혜경   전산   4  76/03/12   221  이병렬   전산
  학생이름 학생학과  학년      생년월일  지도교수 교수이름 교수학과
0  서연우   전산   3  73/10/06   228  이재광   전산
7  김수정   전산   3  77/12/22   228  이재광   전산
  학생이름 학생학과  학년      생년월일  지도교수 교수이름 교수학과
2  이지행   전자   4  73/11/16   311  강승일   전자
3  김형명   전자   4  73/08/29   311  강승일   전자
  학생이름 학생학과  학년      생년월일  지도교수 교수이름 교수학과
4  이원구   건축   3  74/09/30   509  오문환   건축
5  이재영   건축   4  76/02/06   509  오문환   건축

In [55]:
pro.loc[221]

교수이름         이병렬
교수학과          전산
임용일     75/04/03
교수직급         정교수
급여       3000000
Name: 221, dtype: object

In [ ]:
#교수별 지도학생 목록
for idx in pro.index:
    row = pro.loc[idx]
    print('-' * 60)
    print(f'교수번호:{idx} 교수이름:{row["교수이름"]} 교수학과:{row["교수학과"]}')
    filt = stu['지도교수'] == idx
    df = stu[filt]
    for idx in df.index:
        row = df.loc[idx]
        print(f'학생번호:{idx} 학생이름:{row["학생이름"]} 학생학과:{row["학생학과"]}')

------------------------------------------------------------
교수번호:221 교수이름:이병렬 교수학과:전산
학생번호:92414033 학생이름:김창덕 학생학과:전산
학생번호:95414058 학생이름:박혜경 학생학과:전산
------------------------------------------------------------
교수번호:228 교수이름:이재광 교수학과:전산
학생번호:92414029 학생이름:서연우 학생학과:전산
학생번호:96414404 학생이름:김수정 학생학과:전산
------------------------------------------------------------
교수번호:311 교수이름:강승일 교수학과:전자
학생번호:92514009 학생이름:이지행 학생학과:전자
학생번호:92514023 학생이름:김형명 학생학과:전자
------------------------------------------------------------
교수번호:509 교수이름:오문환 교수학과:건축
학생번호:92454018 학생이름:이원구 학생학과:건축
학생번호:95454003 학생이름:이재영 학생학과:건축